Revit 2017 API
FabricationUtils Methods
The FabricationUtils type exposes the following members.
Methods
Name | Description
ValidateConnectivity
 Check if two connectors are valid to connect directly without couplings
See Also
FabricationUtils Class
Autodesk.Revit.DB.Fabrication Namespace